processInterfaceLine.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.oracle.com/apps/financials/receivables/transactions/invoices/invoiceService/types/" xmlns:inv="http://xmlns.oracle.com/apps/financials/receivables/transactions/invoices/invoiceService/" xmlns:tran="http://xmlns.oracle.com/apps/financials/receivables/transactions/autoInvoices/model/flex/TransactionInterfaceGdf/" xmlns:tran1="http://xmlns.oracle.com/apps/financials/receivables/transactions/autoInvoices/model/flex/TransactionLineInterfaceGdf/" xmlns:tran2="http://xmlns.oracle.com/apps/flex/financials/receivables/transactions/autoInvoices/TransactionLineInterfaceLineDff/" xmlns:tran3="http://xmlns.oracle.com/apps/flex/financials/receivables/transactions/autoInvoices/TransactionInterfaceLinkToDff/" xmlns:tran4="http://xmlns.oracle.com/apps/flex/financials/receivables/transactions/autoInvoices/TransactionInterfaceReferenceDff/" xmlns:tran5="http://xmlns.oracle.com/apps/flex/financials/receivables/transactions/autoInvoices/TransactionLineDff/" xmlns:tran6="http://xmlns.oracle.com/apps/flex/financials/receivables/transactions/autoInvoices/TransactionInterfaceHeaderDff/" xmlns:typ1="http://xmlns.oracle.com/adf/svc/types/">
   <soapenv:Header/>
   <soapenv:Body>
      <typ:processInterfaceLine>
         <typ:changeOperation>Create</typ:changeOperation>
         <!--Zero or more repetitions:-->
         <typ:interfaceLine>
            <!--Optional:-->
            <inv:OrgId>300000046987012</inv:OrgId>
            <inv:Amount currencyCode="USD">100</inv:Amount>
            <inv:BatchSourceName>Receivables Import</inv:BatchSourceName>
            <inv:CustomerTrxTypeName>Invoice</inv:CustomerTrxTypeName>
            <inv:BillCustomerAccountNumber>10020</inv:BillCustomerAccountNumber>
            <inv:SalesOrder/>
            <inv:TrxDate>2020-11-03</inv:TrxDate>
            <inv:CurrencyCode>USD</inv:CurrencyCode>
            <inv:ConversionType>User</inv:ConversionType>
            <inv:ConversionRate>1</inv:ConversionRate>
            <inv:GlDate>2020-11-03</inv:GlDate>
            <inv:Description>V1 INV1 Desc</inv:Description>
            <inv:Quantity>1</inv:Quantity>
            <inv:LineType>LINE</inv:LineType>
            <inv:PaymentTermsName>IMMEDIATE</inv:PaymentTermsName>
            <inv:UnitSellingPrice currencyCode="USD">100</inv:UnitSellingPrice>
            <inv:UOMName/>
            <inv:TransactionInterfaceLineDff xsi:type="ns3:WsDffContext" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns3="http://xmlns.oracle.com/apps/flex/financials/receivables/transactions/autoInvoices/TransactionLineInterfaceLineDff/">
               <ns3:__FLEX_Context>WS DFF Context</ns3:__FLEX_Context>
               <ns3:__FLEX_Context_DisplayValue>WS DFF Context</ns3:__FLEX_Context_DisplayValue>
               <ns3:_FLEX_NumOfSegments>2</ns3:_FLEX_NumOfSegments>
               <ns3:vbcsinvoiceid>a1</ns3:vbcsinvoiceid>
               <ns3:vbcsinvoicelineid>b1</ns3:vbcsinvoicelineid>
            </inv:TransactionInterfaceLineDff>
         </typ:interfaceLine>
         <typ:processControl>
            <typ1:partialFailureAllowed>false</typ1:partialFailureAllowed>
         </typ:processControl>
      </typ:processInterfaceLine>
   </soapenv:Body>
</soapenv:Envelope>